//例3.2
/************************************************ 
-计算存款利息。有1000元，想存一年。有3种方法可选： 
-（1）活期，年利率为r1;
-（2）一年期定期，年利率为r2；
-（3）存两次半年定期，年利率为r3。
- 请分别计算出一年后按3种方法所得到的本息和。
***********************************************/

#include <stdio.h>


int main()
{
	float principal = 1000;
	float r1=0.0036, r2=0.0225, r3=0.0198;
	float p1,p2,p3;
	
	p1 = principal * (1+r1);					//计算活期本息和 
	p2 = principal * (1+r2);					//计算一年定期本息和 
	p3 = principal * (1+r3/2) * (1+r3/2);		//计算存两次半年定期的本息和

	printf("p1=%f\np2=%f\np3=%f\n", p1,p2,p3);
	return 0;
}
 
