//第四章习题12
/****************************************************************** 
- 有4个圆塔，圆心分别为(2,2),(-2,2),(-2,-2),(2,-2)，圆半径为1，见 
- 图4.16.这3个塔的高度为10m，塔以外无建筑物。今输入任一点的坐标，
- 求该点的建筑高度(塔外的高度为零）。
*******************************************************************/

#include <stdio.h>
#include <math.h>

int main()
{
	double x,y,a[4]={2,-2,2,-2},b[4]={2,2,-2,-2};
	int i,t;
	scanf("%lf,%lf",&x,&y);
	for(i=0;i<4;i++)
	{
		if(pow(x-a[i],2)+pow(y-b[i],2) <= 1)
		{
			t = 1;
			break;
		}		
		else
			t = 0;
	} 
		
	if(t) printf("建筑物高度为10m");
	else printf("建筑物高度为0m");
	return 0;
} 
