//第五章习题17
/***********************************************************
- 两个乒乓球队进行比赛，各出3人。甲队为A,B,C3人，乙队
- 为X,Y,Z3人。已抽签决定比赛名单。有人向队员打听比赛的
- 名单，A说他不和X比，C说他不和X，Z比，请编程序找出3对
- 赛手的名单。
**********************************************************/
#include <stdio.h>

int main()
{
	char a,b,c;//a,b,c分别为A,B,C的对手,同时满足a!=b!=c, a!=X, c!=X, c!=Z
	int i;
	for(a='Y'; a<='Z'; a++)
	{
		i++;
		for(b='X'; b<='Z'; b++)
		{
			i++;
			if(a!='X' && a!=b)
			{
				for(c='X'; c<='Z';c++)
				{
					i++;
					if(a!=c && b!=c)
					{						
						if(c!='X' && c!='Z')
						{
							printf("A-%c\nB-%c\nC-%c\n",a,b,c);
							printf("%d",i);
							break;
						}
							

					}						
				}					
			}				
		}			
	}
	return 0;			
} 
