//第五章习题9
/***************************************************************************** 
- 一个数如果恰好等于它的因子之和，这个数就称为"完数"。例如，6的因子 
- 为1,2,3，而6=1+2+3，因此6是"完数"。编程序找出1000之内的所有完数，
- 并按下面格式输出其因子：
- 6 its factors are 1,2,3
*****************************************************************************/

#include <stdio.h>
#include <math.h>

int main()
{
	int i,n,sum=0,a[100],j,k=0;//k记录因子个数，数组a存储因子 
	for(i=1; i<=1000; i++)
	{
		sum=0;
		k = 0;
		for(n=1; n <= (int)(i/2); n++)
		{
			if(i%n == 0)
			{
				sum += n;
				a[k] = n;
				k++;										
			}			 	
		}
		if(sum == i)
		{
			printf("%d its factors are %d",i,a[0]);
			if(n > 1)
				for(j=1;j<k;j++)
					printf(",%d",a[j]);
			printf("\n");
		}					
	}
	return 0;	
} 
