//例5.11
/*********************************************************************** 
- 译密码。为使电文保密，往往按一定规律将其转换成密码，收报人再按约定 
- 的规律将其译回原文。
- 规律：原字母变成其后的第4个字母，如 "China！"转换为"Glmre！"。
- 从键盘输入一行字符，要求输出其相应的密码。
***********************************************************************/

#include <stdio.h>

int main()
{
	char c;
	c = getchar();
	while(c != '\n')
	{
		if((c>='a' && c<='z') || (c>='A' && c<='Z'))		
		{
			if((c>='w' && c<='z') || (c>='W' && c<='Z'))
				c -= 22;
			else
				c += 4;	
		}
		printf("%c",c);
		c=getchar();
	}	
	printf("\n");
	return 0;
} 
