//例4.1
/********************************************************************
- 在例3.5的基础上程序进行改进。题目要求解得 ax^2 + bx + c = 0 方
- 程的根。由键盘输入a,b,c。假设a,b,c的值任意，并不保证 b^2 - 4ac >= 0。
- 需要在程序中进行判别，如果 b^2 - 4ac >= 0,就计算并输出方程的两个实根，
- 如果b^2 - 4ac < 0，就输出"方程无实根"的信息。
*********************************************************************/

#include <stdio.h>
#include <math.h>


int main()
{
	double a,b,c;
	double p,q;
	double x1,x2;
	scanf("%lf %lf %lf",&a,&b,&c);
	
	if((b*b - 4*a*c) >= 0)
	{
		p = (-b) / (2*a);
		q = sqrt(b*b - 4*a*c) / (2*a);
		x1 = p+q;
		x2 = p-q;

		printf("x1 = %7.2f\nx2 = %7.2f",x1,x2);
	}
	else
		printf("方程无实根。");
	
	return 0;
}
